<?php

return [
    'login' => [
        'successfully' => 'ورود با موفقیت انجام شد.',
        'error' => 'کاربری با این مشخصات یافت نشد!'
    ],
    'have_not_permission' => 'شما درسترسی لازم را ندارید!',
    'users' => [
        'create' => [
            'success' => 'ثبت کاربر با موفقیت انجام شد.',
            'failed' => 'خطا در ثبت کاربر!'
        ],
        'update' => [
            'success' => 'عملیات به روزرسانی کاربر با موفقیت انجام شد.',
            'failed' => 'خطا در به روزرسانی کاربر'
        ],
        'destroy' => [
            'success' => 'کاربر با موفقیت حذف شد.',
            'failed' => 'خطا در حذف کاربر'
        ]
    ],
    'tasks' => [
        'create' => [
            'success' => 'ثبت تسک با موفقیت انجام شد.',
            'failed' => 'خطا در ثبت تسک!'
        ],
        'update' => [
            'success' => 'عملیات به روزرسانی تسک با موفقیت انجام شد.',
            'failed' => 'خطا در به روزرسانی تسک'
        ],
        'destroy' => [
            'success' => 'تسک با موفقیت حذف شد.',
            'failed' => 'خطا در حذف تسک'
        ]
    ],
];